config/cf/Documents/ЗакреплениеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЗакреплениеСотрудников</Name>
			<BasedOn>
				<xr:Item>Catalog.МестаХранения</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
				<xr:Item>Document.Задание</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОтветственныеСотрудники</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторКорректировки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКорректировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОтветственныйСотрудник</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/cf/InformationRegisters/ОтветственныеСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеСотрудники</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтветственныйСотрудник</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/cf/Documents/ЗакреплениеСотрудников/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
КонецПроцедуры

// Проверка объекта на обязательные реквизиты перед проведением.
Процедура ПроверитьДокументПередПроведением(ДополнительныеСвойства, Отказ) Экспорт
	
	// Проверка, что нет дублей в ТЧ по Месту хранения.
	ТЗ = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗакреплениеСотрудников.Скопировать();
	ТЗ.Колонки.Добавить("КоличествоМестХранения");	
	ТЗ.ЗаполнитьЗначения(1, "КоличествоМестХранения");	
	ТЗ.Свернуть("МестоХранения", "КоличествоМестХранения");
	
	Для Каждого Стр Из ТЗ Цикл 
		Если Стр.КоличествоМестХранения > 1 Тогда   
			УправлениеITОтделом8УФ.СообщитьОбОшибке(ЭтотОбъект, 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В таблице найдено повторяющееся место хранения %1'"), "'" + Строка(Стр.МестоХранения) + "'"),,,
					"Сотрудники", Отказ);
		КонецЕсли;
	КонецЦикла;
	
	// Проверка, был ли закреплен сотрудник за местом хранения ранее.
	ЗапросОтветственных = Новый Запрос();
	ЗапросОтветственных.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтветственныеСотрудникиСрезПоследних.МестоХранения,
		|	ОтветственныеСотрудникиСрезПоследних.Сотрудник,
		|	ОтветственныеСотрудникиСрезПоследних.Регистратор
		|ИЗ
		|	РегистрСведений.ОтветственныеСотрудники.СрезПоследних(&Дата, ) КАК ОтветственныеСотрудникиСрезПоследних
		|ГДЕ
		|	ОтветственныеСотрудникиСрезПоследних.МестоХранения = &МестоХранения";
		
	ЗапросОтветственных.УстановитьПараметр("МестоХранения", ЭтотОбъект.Сотрудники[0].МестоХранения);
	ЗапросОтветственных.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	НоваяТЗ = ЗапросОтветственных.Выполнить().Выгрузить();
	
	ПараметрыОтбора = Новый Структура;
	Для Каждого Строки Из НоваяТЗ Цикл
		ПараметрыОтбора.Вставить("Сотрудник", Строки.Сотрудник);
		ПараметрыОтбора.Вставить("МестоХранения", Строки.МестоХранения);
		ПараметрыОтбора.Вставить("Регистратор", Строки.Регистратор);
		НайденныеСтроки = НоваяТЗ.НайтиСтроки(ПараметрыОтбора);
		Если ЗначениеЗаполнено(НайденныеСтроки[0].Сотрудник) И ЭтотОбъект.Сотрудники[0].Сотрудник = НайденныеСтроки[0].Сотрудник Тогда
			УправлениеITОтделом8УФ.СообщитьОбОшибке(ЭтотОбъект, 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В таблице за сотрудником %1 уже закреплено место хранения %2'"), "'" + Строка(ЭтотОбъект.Сотрудники[0].Сотрудник) + "'", Строка(ЭтотОбъект.Сотрудники[0].МестоХранения))
			, , , "Сотрудники", Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеITОтделом8УФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	СЛС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	
	// Проверка объекта.
	ПроверитьДокументПередПроведением(ДополнительныеСвойства, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Подготовка наборов записей.
	УправлениеITОтделом8УФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	СЛС.ОтразитьДвиженияВРазделахУчета(Ссылка, ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	УправлениеITОтделом8УФ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Комментарий = Строка(ДанныеЗаполнения);
		Основание = ДанныеЗаполнения;
		
		НоваяСтрока = Сотрудники.Добавить();
		НоваяСтрока.Сотрудник = ДанныеЗаполнения;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.МестаХранения") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Комментарий = Строка(ДанныеЗаполнения);
		Основание = ДанныеЗаполнения;
		
		НоваяСтрока = Сотрудники.Добавить();
		НоваяСтрока.МестоХранения = ДанныеЗаполнения;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Задание") Тогда
		Организация					= ДанныеЗаполнения.Организация;
		Комментарий					= ДанныеЗаполнения.Тема;
		Основание					= ДанныеЗаполнения;
		НоваяСтрока					= Сотрудники.Добавить();
		НоваяСтрока.МестоХранения	= ДанныеЗаполнения.МестоХранения;
		Если ТипЗнч(ДанныеЗаполнения.Инициатор) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			НоваяСтрока.Сотрудник	= УправлениеITОтделом8УФ.СотрудникПоОрганизацииИФизЛицу(Организация, ДанныеЗаполнения.Инициатор);
		КонецЕсли;
	КонецЕсли
КонецПроцедуры

#КонецОбласти

#КонецЕсли
